#define _CRT_SECURE_NO_WARNINGS 1

//
//下列程序执行后，输出的结果为()
//#include <stdio.h>
//int cnt = 0;
//int fib(int n)
//{ 
//	cnt++; 
//	if (n == 0)
//		return 1;
//	else if (n == 1)
//		return 2;
//	else
//		return fib(n - 1) + fib(n - 2);
//}
//void main()
//{
//	fib(8);
//	printf("%d", cnt);
//}
//A 41
//B 67
//C 109
//D 177
// 
// B
// 拆到1或0就停止，最后统计有几个数
// 
// 
//
// 以下程序的输出结果是 ?
//int x = 1; 
//do 
//{
//	printf("%2d\n", x++);
//} while (x--);
// A 1
// B 无任何输出
// C 2	
// D 陷入死循环
// 
// 
// D
//
//下面的代码段中，执行之后i和j的值是什么()
//int i = 1;
//int j; 
//j = i++;
//A 1, 1
//B 1, 2
//C 2, 1
//D 2, 2
//
//C
// 
// 
//以下程序的k最终值是:
//int i = 10;
//int j = 20; 
//int k = 3; 
//k *= i + j;
//A 90
//B 50
//C 70
//D 30
//
//A
//
//
//以下程序的最终的输出结果为 :
//iinclude<stdio.h>
//#include<stdlib.h>
//int a = 1; 
//void test() 
//{
//	int a = 2;
//	a += 1;
//}
//int main() 
//{
//	test();
//	printf("%d\n", a);
//	return 0;
//}
//此时打印a的值为:
//A   1
//B	  2
//C	  3
//D	  4
//
//A


//一个C源程序可由一个或多个函数组成
//一个C源程序必须包含一个main函数
//c程序的基本组成单位是函数
//c语言本身没有输入输出语句
//
//c语言只有各种语法，库函数是根据语法创建的，不是c语言自带的
//
//
//
//执行如下代码，c的值是 :
//int a = 0, c = 0; 
//do 
//{
//	--c;
//	a = a - 1;
//} while (a > 0);
//A 0
//B 1
//C -1
//D 死循环
//正确答案 :C


//假定x和y为double型，则执行
//x = 2; y = x + 3 / 2
//y的值为()
//A 3.500000
//B 3
//C 2.000000
//D 3.000000
//
//答案：D
//
//
//
//以下for循环的执行次数是()。
//for(x = 0, y = 0; (y = 123) && (x < 4); x++);
//A 是无限循环
//B 循环次数不定
//C 4次
//D 3次
//
//答案：C
//
//
//
//若有定义语句 : int year = 1009，*p=&year；
//以下不能使变量 year 中的值增至 1010 的语句是
//A *p+=1
//B (*p)++
//C ++(*p)
//D *p++
//
//答案：D
//
//++优先级大于*，没()的话，先++，p地址后移，再解引用

// 14题